myinit.org
#+STARTUP: overview
#+PROPERTY: header-args :comments yes :results silent

* repos 
Add package website to list
#+BEGIN_SRC emacs-lisp

(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)

#+END_SRC

* Themes and modeline
Config editor themes, see more https://github.com/hlissner/emacs-doom-themes
#+BEGIN_SRC emacs-lisp

(use-package color-theme-modern
:ensure t)
(use-package doom-themes
:ensure t)
(use-package doom-modeline
:ensure t)

(require 'doom-modeline)
(doom-modeline-init)

(load-theme 'doom-monokai-classic  t)

;; Enable flashing mode-line on errors
(doom-themes-visual-bell-config)

;; Enable custom neotree (all-the-icons must be installed!)
(doom-themes-neotree-config)

;; or for treemacs users
(setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
(doom-themes-treemacs-config)

;; corrects (and improves) org-mode's native fontification
(doom-themes-org-config)

#+END_SRC

* Org-mode
Config org-mode, see more https://orgmode.org/
#+BEGIN_SRC emacs-lisp

(use-package org
:ensure t
:pin org)

;; this config for linux
;; (setenv "BROWSER" "chromium-browser")
(use-package org-bullets
:ensure t
:config
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

;; this config for linux
;; (setq org-file-apps (append '(
;; ("\\.pdf\\'" . "evince %s")
;; ("\\.x?html?\\'" . "/usr/bin/chromium-browser %s")
;; ) org-file-apps ))

;; this config for macOS
(setq org-file-apps (append '(
("\\.pdf\\'" . "open %s")
) org-file-apps ))

#+END_SRC

